Управление_по_целям_и_KPI/src/Catalogs/KPI_Должности/KPI_Должности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_Должности</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>ПлановыеНачисления</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.KPI_Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/Catalogs/KPI_Должности/ManagerModule.bsl
//Функция получает плановые начисления по объектам управления
//Параметры:
// ОбъектыУправления - тип массив, тип элементов массива СправочникСсылка.KPI_СтруктураКомпании;
//Возвращаемое значение:
//  Плановые начисления объектов управления - тип таблица значений
Функция ПлановыеНачисления(ОбъектыУправления) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОбъектыУправления.СтруктураКомпании,
	|	ОбъектыУправления.Должность
	|ПОМЕСТИТЬ ОбъектыУправления
	|ИЗ
	|	&ТЗ КАК ОбъектыУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыУправления.СтруктураКомпании,
	|	KPI_ДолжностиПлановыеНачисления.Ссылка,
	|	KPI_ДолжностиПлановыеНачисления.Начисление,
	|	KPI_ДолжностиПлановыеНачисления.Сумма
	|ИЗ
	|	ОбъектыУправления КАК ОбъектыУправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.KPI_Должности.ПлановыеНачисления КАК KPI_ДолжностиПлановыеНачисления
	|		ПО ОбъектыУправления.Должность = KPI_ДолжностиПлановыеНачисления.Ссылка
	|ГДЕ
	|	KPI_ДолжностиПлановыеНачисления.Ссылка В(&Должности)";
	
	Запрос = Новый Запрос(ТекстЗапроса);  
		
	ОбъектыУправления.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.KPI_Должности"));
	
	Для каждого Элемент Из ОбъектыУправления Цикл
		Элемент.Должность = Элемент.СтруктураКомпании.Должность;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТЗ", ОбъектыУправления);
	Запрос.УстановитьПараметр("Должности", ОбъектыУправления.ВыгрузитьКолонку("Должность"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
